Revit 2024 API
StructuralMaterialType Enumeration
 Represents the structural material type. This enum value is returned by Autodesk::Revit::DB::FamilyInstance::StructuralMaterialType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Since: 2011
Syntax
C#
public enum StructuralMaterialType
Visual Basic
Public Enumeration StructuralMaterialType
Visual C++
public enum class StructuralMaterialType
Members
Member name | Description
Undefined |  Structural material type is undefined.
Steel |  Structural material type is steel.
Concrete |  Structural material type is concrete.
Wood |  Structural material type is wood.
Other |  Structural material type is other.
PrecastConcrete |  Structural material type is precast concrete.
Generic |  Structural material type is generic.
Aluminum |  Structural material type is aluminum.
See Also
Autodesk.Revit.DB.Structure Namespace